###############################################################################
# Created by write_sdc
###############################################################################
current_design Branch_Metrics
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {received[0]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {received[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_00_00[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_00_00[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_00_10[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_00_10[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_01_00[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_01_00[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_01_10[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_01_10[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_10_01[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_10_01[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_10_11[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_10_11[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_11_01[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_11_01[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_11_11[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {bm_11_11[1]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {bm_00_00[1]}]
set_load -pin_load 0.0334 [get_ports {bm_00_00[0]}]
set_load -pin_load 0.0334 [get_ports {bm_00_10[1]}]
set_load -pin_load 0.0334 [get_ports {bm_00_10[0]}]
set_load -pin_load 0.0334 [get_ports {bm_01_00[1]}]
set_load -pin_load 0.0334 [get_ports {bm_01_00[0]}]
set_load -pin_load 0.0334 [get_ports {bm_01_10[1]}]
set_load -pin_load 0.0334 [get_ports {bm_01_10[0]}]
set_load -pin_load 0.0334 [get_ports {bm_10_01[1]}]
set_load -pin_load 0.0334 [get_ports {bm_10_01[0]}]
set_load -pin_load 0.0334 [get_ports {bm_10_11[1]}]
set_load -pin_load 0.0334 [get_ports {bm_10_11[0]}]
set_load -pin_load 0.0334 [get_ports {bm_11_01[1]}]
set_load -pin_load 0.0334 [get_ports {bm_11_01[0]}]
set_load -pin_load 0.0334 [get_ports {bm_11_11[1]}]
set_load -pin_load 0.0334 [get_ports {bm_11_11[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {received[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {received[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
