###############################################################################
# Created by write_sdc
###############################################################################
current_design Path_Metric_Unit
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_00_00[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_00_00[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_00_10[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_00_10[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_01_00[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_01_00[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_01_10[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_01_10[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_10_01[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_10_01[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_10_11[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_10_11[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_11_01[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_11_01[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_11_11[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {bm_11_11[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clr_me}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_00[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_00[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_00[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_00[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_01[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_01[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_01[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_01[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_10[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_10[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_10[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_10[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_11[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_11[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_11[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_metric_11[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {servivor_select_00}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {servivor_select_01}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {servivor_select_10}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {servivor_select_11}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {servivor_select_00}]
set_load -pin_load 0.0334 [get_ports {servivor_select_01}]
set_load -pin_load 0.0334 [get_ports {servivor_select_10}]
set_load -pin_load 0.0334 [get_ports {servivor_select_11}]
set_load -pin_load 0.0334 [get_ports {current_metric_00[3]}]
set_load -pin_load 0.0334 [get_ports {current_metric_00[2]}]
set_load -pin_load 0.0334 [get_ports {current_metric_00[1]}]
set_load -pin_load 0.0334 [get_ports {current_metric_00[0]}]
set_load -pin_load 0.0334 [get_ports {current_metric_01[3]}]
set_load -pin_load 0.0334 [get_ports {current_metric_01[2]}]
set_load -pin_load 0.0334 [get_ports {current_metric_01[1]}]
set_load -pin_load 0.0334 [get_ports {current_metric_01[0]}]
set_load -pin_load 0.0334 [get_ports {current_metric_10[3]}]
set_load -pin_load 0.0334 [get_ports {current_metric_10[2]}]
set_load -pin_load 0.0334 [get_ports {current_metric_10[1]}]
set_load -pin_load 0.0334 [get_ports {current_metric_10[0]}]
set_load -pin_load 0.0334 [get_ports {current_metric_11[3]}]
set_load -pin_load 0.0334 [get_ports {current_metric_11[2]}]
set_load -pin_load 0.0334 [get_ports {current_metric_11[1]}]
set_load -pin_load 0.0334 [get_ports {current_metric_11[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clr_me}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_00_00[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_00_00[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_00_10[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_00_10[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_01_00[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_01_00[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_01_10[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_01_10[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_10_01[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_10_01[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_10_11[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_10_11[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_11_01[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_11_01[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_11_11[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bm_11_11[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
